# -*- coding: utf-8 -*-
# @Time   : 2022/1/23 18:33
# @Author : beyoung
# @Email  : linbeyoung@stu.pku.edu.cn
# @File   : neteasy_choice.py

target =[
 {'字段13_文本': '基于弱监督学习的异常检测',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1698&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '用户画像',
  '字段18': '2023届及以后',
  '字段19': '在游戏场景中最常见的异常就是外挂机器人，外挂严重破坏了游戏平衡性，伤害了游戏玩家利益和游戏体验，给游戏厂商也造成了不可弥补的损害。外挂的特点一是很难做到完备标记，一般的有监督方案只能解决已知外挂检测；二是极易变异和衍生新型外挂，无监督异常检测是一种可行方案但效率、效果和成本相对昂贵。如何将有限的异常标签结合起来，进行弱监督的异常检测，具有高价值的研究和落地意义。',
  '字段20': '1.有一定游戏经历（有网易游戏体验经历者优先），热爱人工智能；\n'
          '2.熟悉常用的机器学习、深度学习、数据挖掘相关算法；\n'
          '3.熟悉掌握并使用Python语言，了解至少一种其它编程语言，包括但不限于C/C++、Java、R、Lua等；\n'
          '4.熟练使用主流深度学习框架，如tensorflow、pytorch、keras等，有端上深度学习经验者优先；\n'
          '5.对游戏与AI技术结合的场景，如游戏反外挂系统、游戏匹配系统、游戏战报系统、玩家流失原因分析等有热情、有想法；\n'
          '6.具有良好的沟通、协作和语言表达能力，较高的开发效率，责任意识强；\n'
          '7.专注、精益求精、时间规划能力强、有主动学习及深入思考的能力；\n'
          '8.具有良好的数学基础、英语信息检索能力和阅读能力；\n'
          '9.编程基础扎实，逻辑思维能力强，有较强的学习能力和创新思维。\n'
          '\n'
          '加分项：\n'
          '1.有KDD、WWW、ICML、NIPS、ICLR、AAAI、IJCAI、ICDM、WSDM、CIKM等论文发表者优先；\n'
          '2.有AutoML、计算机视觉等人工智能领域经验者优先；\n'
          '3.有运筹优化/组合优化、强化学习等人工智能领域经验者优先；\n'
          '4.有因果推断、可解释性AI等人工智能领域经验者优先；\n'
          '5.可保证实习六个月及以上，能够长期实习的同学优先。'},

 {'字段13_文本': 'NLP在AI创作中的研究',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1712&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': 'NLP',
  '字段18': '2023届及以后',
  '字段19': 'NLP在AI创作领域越来越广泛，例如写诗、写歌词、写文章都有很多应用场景。但是目前的AI创作存在以下问题： '
          '对于长文本的AI创作，前后逻辑保持一致是困难的。 '
          '如果一次性生成的效果不佳，是否可以利用AI进行辅助创作，通过生成+修改的方式创造比较好的作品。 a. 研究如何提升AI生成文本的质量  '
          'b. 研究AI辅助文本创作的方式，类如句子改写，段落推荐等。',
  '字段20': '1. '
          '对深度学习和NLP的基础概念有深入的理解，例如Transformer的结构，常见的神经网络模块，常见的优化算法，基本的NLP任务和评测指标，以及常见的技巧如模型蒸馏、数据增强等等；\n'
          '2. 具有较强的软件工程技能，并能根据自己钻研的研究问题的需要，自如地应对工程挑战；\n'
          '3. 能够快速落实研究思路，对其进行迭代，并进行实证评估；\n'
          '4. 对NLP前沿研究保持敏锐关注，了解预训练、课程学习、对抗训练等技术热点。\n'
          '\n'
          '加分项：\n'
          '1. '
          '在人工智能及自然语言处理相关的顶级会议(如：ACL、EMNLP、NAACL、AAAI、IJCAI、ICASSP等）上发表过论文（一作或二作）；\n'
          '2. 有自然文本生成、模型压缩等相关的项目经验。'},

 {'字段13_文本': '人体动作重定向',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1704&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '虚拟人',
  '字段18': '2023届及以后',
  '字段19': '数字虚拟人肢体驱动依赖于角色三维模型的关节控制器。本课题研究如何将现有数字虚拟人的肢体动画参数重定向到肢体比例不完全对应的其他三维模型上，增加虚拟数字人算法的普适性与扩展性。  '
          '工作内容： 1. 学习调研关于人体动作重定向的前沿研究、围绕相关业务落地场景、负责/参与某个模块的算法设计、代码实现、算法调优等；  '
          '2. 鼓励投稿人工智能领域顶级会议论文；  3. 按个人意愿，可以独立承担课题，也可以参与团队共同完成课题；',
  '字段20': '1. 具有良好的深度学习基础，熟练使用python，至少熟练使用一门深度学习框架，如pytorch、tensorflow等；\n'
          '2. 至少有一项基于深度学习技术的项目经验，项目背景不限；\n'
          '3. 有责任心和上进心，自我驱动力强，求知欲强；     \n'
          '\n'
          '加分项：\n'
          '1. 从事过人体关键点检测、动作识别、三维人体重建、人体运动学等方向；\n'
          '2. 有AI顶级会议或期刊发表经历。'},

{'字段13_文本': '生成模型生成结果排序研究',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1708&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': 'NLP',
  '字段18': '2023届及以后',
  '字段19': '预训练技术显著地提升了文本生成的效果，但是就起本质而言仍然是训练深度学习模型去拟合目标文本的分布。在推断时，从模型预测的分布使用Top-k或者Top-p的方法进行采样。针对同一条输入通过采样可以得到多条生成结果，这些不同的生成结果质量有好有坏，如果可以建立一个有效的排序模型，那么就必然可以使模型的生成结果质量有所提升。Openai '
          '在Training Verifiers to Solve Math Word Problems '
          '这篇论文的工作也说明了一个中等大小的模型加上可靠的排序模型效果是可以比肩非常大的模型。 a.调研和复现文本生成结果排序工作 '
          'b.研究更加有效的不需要标注样本的文本生成结果排序模型。 c.撰写学术论文并投稿',
  '字段20': '1. '
          '对深度学习和NLP的基础概念有深入的理解，例如Transformer的结构，常见的神经网络模块，常见的优化算法，基本的NLP任务和评测指标，以及常见的技巧如模型蒸馏、数据增强等等 '
          '；\n'
          '2. 具有较强的软件工程技能，并能根据自己钻研的研究问题的需要，自如地应对工程挑战 ；\n'
          '3. 能够快速落实研究思路，对其进行迭代，并进行实证评估 ；\n'
          '4. 对NLP前沿研究保持敏锐关注，了解预训练、课程学习、对抗训练等技术热点 。\n'
          '\n'
          '加分项： \n'
          '1. '
          '在人工智能及自然语言处理相关的顶级会议(如：ACL、EMNLP、NAACL、AAAI、IJCAI、ICASSP等）上发表过论文（一作或二作）；\n'
          '2. 有自然文本生成、模型压缩等相关的项目经验。'},

 {'字段13_文本': '基于数据质量的众包标注',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1699&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '用户画像',
  '字段18': '2023届及以后',
  '字段19': '数据质量决定了模型效果的上限，而标注是数据质量中的核心环节，如何通过众包平台保质、高效、低成本地获取高质量数据是当下最有价值的AI类研究课题之一',
  '字段20': '1.有一定游戏经历（有网易游戏体验经历者优先），热爱人工智能；\n'
          '2.熟悉常用的机器学习、深度学习、数据挖掘相关算法；\n'
          '3.熟悉掌握并使用Python语言，了解至少一种其它编程语言，包括但不限于C/C++、Java、R、Lua等；\n'
          '4.熟练使用主流深度学习框架，如tensorflow、pytorch、keras等，有端上深度学习经验者优先；\n'
          '5.对游戏与AI技术结合的场景，如游戏反外挂系统、游戏匹配系统、游戏战报系统、玩家流失原因分析等有热情、有想法；\n'
          '6.具有良好的沟通、协作和语言表达能力，较高的开发效率，责任意识强；\n'
          '7.专注、精益求精、时间规划能力强、有主动学习及深入思考的能力；\n'
          '8.具有良好的数学基础、英语信息检索能力和阅读能力；\n'
          '9.编程基础扎实，逻辑思维能力强，有较强的学习能力和创新思维。\n'
          '\n'
          '加分项：\n'
          '1.有KDD、WWW、ICML、NIPS、ICLR、AAAI、IJCAI、ICDM、WSDM、CIKM等论文发表者优先；\n'
          '2.有AutoML、计算机视觉等人工智能领域经验者优先；\n'
          '3.有运筹优化/组合优化、强化学习等人工智能领域经验者优先；\n'
          '4.有因果推断、可解释性AI等人工智能领域经验者优先；\n'
          '5.可保证实习六个月及以上，能够长期实习的同学优先。'},


 {'字段13_文本': '高品质动态GI渲染',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1696&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '雷火事业群',
  '字段17': '图形学引擎',
  '字段18': '2023届及以后',
  '字段19': '调研高品质Real-Time GI的实现算法；用于支撑AAA级游戏的核心光照',
  '字段20': '1. 计算机或相关专业，本科及以上学历； \n'
          '2. 图形学有良好的基础，理解常见的渲染知识；\n'
          '3. 沟通能力、学习能力强；\n'
          '4. 在渲染上有一定实践经验；\n'
          '5. 算法能力好，编程能力扎实；\n'
          '6. 热爱游戏和游戏开发。\n'
          '\n'
          '加分项： \n'
          '1. 对Unity、UE引擎其中一款引擎有使用经验。'},

 {'字段13_文本': '基于背景信息的文本生成研究',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1711&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': 'NLP',
  '字段18': '2023届及以后',
  '字段19': '生成背景信息相关的文本具有巨大的应用价值，尤其是多样化的背景信息，例如世界信息、人物关系、武器属性等，生成这些背景信息相关的文本，可以辅助小说撰写、降低开放式结局的小说的维护成本、提供更具有可玩性的文字游戏。目前文本生成模型还难以生成与背景信息相匹配的文本，可以从背景信息的利用、背景信息相关的预训练等方面进行研究。另外，背景信息相关性的自动评测也暂时没有成熟的解决方案。 '
          'a. 建立背景信息相关的文本生成benchmark，提供一套背景信息用于文本生成、一个训练好的分类器作为评测指标。  b. '
          '利用semi-supervised的训练方式，从原始文本中抽取背景信息，并且训练背景信息相关的文本生成模型。  c. '
          '快速利用大量背景信息的模型结构。',
  '字段20': '1. '
          '对深度学习和NLP的基础概念有深入的理解，例如Transformer的结构，常见的神经网络模块，常见的优化算法，基本的NLP任务和评测指标，以及常见的技巧如模型蒸馏、数据增强等等；\n'
          '2. 具有较强的软件工程技能，并能根据自己钻研的研究问题的需要，自如地应对工程挑战；\n'
          '3. 能够快速落实研究思路，对其进行迭代，并进行实证评估；\n'
          '4. 对NLP前沿研究保持敏锐关注，了解预训练、课程学习、对抗训练等技术热点。\n'
          '\n'
          '加分项：\n'
          '1. '
          '在人工智能及自然语言处理相关的顶级会议(如：ACL、EMNLP、NAACL、AAAI、IJCAI、ICASSP等）上发表过论文（一作或二作）；\n'
          '2. 有自然文本生成、模型压缩等相关的项目经验。'},

 {'字段13_文本': '音乐预训练的研究',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1709&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': 'NLP',
  '字段18': '2023届及以后',
  '字段19': '随着预训练技术在各个文本、图像、语音等领域有了深入的研究和应用，音乐领域的预训练相对来说起步较晚。目前已有的音乐预训练模型jukebox是完全end2end的方式，但是计算资源消耗比较大；还有一些工作围绕音乐的各细分环节进行预训练，其存在预训练数据难以获取的问题。本课题希望能够通过对音乐的预训练，能够对音乐音频进行建模，对下游业务产生价值，例如音乐检索，视频配乐等场景。研究内容：a. '
          '调研现有的音乐预训练的文章 b. 基于干声预训练音乐模型 c. 探究包含多通道信息的音乐音频数据的预训练 d. '
          '探究音乐预训练在下游任务上的应用 e. 撰写学术论文',
  '字段20': '1. '
          '对深度学习和NLP的基础概念有深入的理解，例如Transformer的结构，常见的神经网络模块，常见的优化算法，基本的NLP任务和评测指标，以及常见的技巧如模型蒸馏、数据增强等等 '
          '；\n'
          '2. 具有较强的软件工程技能，并能根据自己钻研的研究问题的需要，自如地应对工程挑战 ；\n'
          '3. 能够快速落实研究思路，对其进行迭代，并进行实证评估 ；\n'
          '4. 对NLP前沿研究保持敏锐关注，了解预训练、课程学习、对抗训练等技术热点 。\n'
          '\n'
          '加分项： \n'
          '1. '
          '在人工智能及自然语言处理相关的顶级会议(如：ACL、EMNLP、NAACL、AAAI、IJCAI、ICASSP等）上发表过论文（一作或二作） '
          '；\n'
          '2. 有自然文本生成、模型压缩等相关的项目经验。'},

 {'字段13_文本': '基于RGB照片的游戏三维人脸重建',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1713&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '图像',
  '字段18': '2023届及以后',
  '字段19': '根据单张或多张人脸照片进行三维人脸重建是计算机视觉领域的热门研究方向，目前大多数三维人脸重建方法都是基于3DMM实现的，并且其生成的纹理信息（顶点颜色或贴图）质量不够高，不能直接应用于游戏中。该项目的主要目标是，根据用户上传的任意人脸照片，生成能够在游戏中使用的三维人脸（人头）模型及贴图等。需要生成的数据包括但不限于：游戏人脸Mesh、Diffuse贴图、Normal贴图等。此外，我们还希望能够根据不同的游戏，生成符合游戏风格的人脸。',
  '字段20': '1. 熟练使用C++，Python。\n'
          '2. 熟练使用OpenGL，了解三维模型及渲染基础知识。\n'
          '3. 熟练使用PyTorch或TensorFlow深度学习库。\n'
          '加分项：\n'
          '1. 熟悉三维人脸重建、游戏渲染管线、可微渲染技术等，有相关项目经验或论文。\n'
          '2. 在计算机视觉相关顶会（Sigraph/ Sigraph '
          'Asian、NIPS、CVPR、ICCV、ECCV、AAAI等）发表过人脸相关论文。'},

 {'字段13_文本': '图文多模态预训练研究',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1710&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': 'NLP',
  '字段18': '2023届及以后',
  '字段19': '图文信息是很多应用中的表现信息，例如朋友圈、配图文章、某些聊天场景，一个能够理解图文内容的模型，可以帮助进行更好的内容搜索、推荐、生产（例如图片生成、图片评论生成、视频封面选取等）。目前图文模型还远达不到人类的水平，因此有很大的研究空间： '
          '1. 如何利用在模型中体现图像、文本对齐的信息，并且帮助更好地预训练一个图文模型；2. '
          '生成高质量、可控性强、艺术性强的图像。研究思路：a. 研究图文预训练模型的结构、训练目标。  b. 可以由任意文本进行控制的图像生成。',
  '字段20': '1. '
          '对深度学习和NLP的基础概念有深入的理解，例如Transformer的结构，常见的神经网络模块，常见的优化算法，基本的NLP任务和评测指标，以及常见的技巧如模型蒸馏、数据增强等等；\n'
          '2. 具有较强的软件工程技能，并能根据自己钻研的研究问题的需要，自如地应对工程挑战；\n'
          '3. 能够快速落实研究思路，对其进行迭代，并进行实证评估；\n'
          '4. 对NLP前沿研究保持敏锐关注，了解预训练、课程学习、对抗训练等技术热点。\n'
          '\n'
          '加分项：\n'
          '1. '
          '在人工智能及自然语言处理相关的顶级会议(如：ACL、EMNLP、NAACL、AAAI、IJCAI、ICASSP等）上发表过论文（一作或二作）；\n'
          '2. 有自然文本生成、模型压缩等相关的项目经验。'},

 {'字段13_文本': '人脸表情识别',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1706&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '虚拟人',
  '字段18': '2023届及以后',
  '字段19': '伏羲虚拟人团队已在ICCV2021第二届人脸表情分析挑战赛中，斩获两项冠军一项亚军，相关技术发表在CVPR2021和ICCV2021，并已应用于网易游戏产品中。  '
          '工作内容：\u200b '
          '在团队已有工作基础上，提升基于人脸表情各项识别任务的准确率，包括情绪识别、表情动作单元识别、微表情识别、愉悦度&唤醒度评估，等等。',
  '字段20': '1.良好的自驱力、上进心、学习能力；\n'
          '2.具有良好的深度学习基础，熟练使用python，至少熟练使用一门深度学习框架，如pytorch、tensorflow等。\n'
          '\n'
          '加分项：\n'
          '1.从事过数据不平衡、少/难样本训练、情绪识别、表情识别、多模态情绪识别等相关领域工作；\n'
          '2.有AI顶级会议或期刊发表经历。'},

{'字段13_文本': '单/多模态（语音、文本、视觉）情感计算',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1702&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '虚拟人',
  '字段18': '2023届及以后',
  '字段19': '随着社交网络、交互技术的发展，以及最近元宇宙概念的兴起，人与机器的情感交互显得尤为重要。如通过获取到的图文、语音等理解用户表达的情绪，或通过机器传递出某种情绪，都离不开情感计算技术。如何分析单/多模态数据中的情感，是当前情感分析领域面临的机遇和挑战。  '
          '工作内容： 1. 参与（或主导）基于单/多模态（语音、文本、人脸表情）数据的情感识别或面向数字人的情绪化驱动； 2. '
          '学习调研前沿研究，负责某个模块的算法设计、代码实现、算法调优等；  3. 鼓励投稿人工智能领域顶级会议论文；\u200b',
  '字段20': '1. 具有深度学习基础，熟练使用python，至少熟练使用一门深度学习框架，如pytorch、tensorflow等； \n'
          '2. 至少有一项基于深度学习技术的项目经验，项目背景不限； \n'
          '3. 有责任心和上进心，自我驱动力强，求知欲强。      \n'
          '\n'
          '加分项：\n'
          '1. 从事过人脸和人体算法、动画参数合成、情感计算、多模态信号处理、自然语言处理、或语音信号处理； \n'
          '2. 有AI顶级会议或期刊发表经历者优先。'},

 {'字段13_文本': '人脸表情迁移/重建/编辑',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1707&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '虚拟人',
  '字段18': '2023届及以后',
  '字段19': '网易伏羲虚拟人团队在表情迁移/重建/编辑方向已有长时间积累，包括论文发表（CVPR、IJCAI、AAAI）和落地应用。丰富的人脸表情是数字虚拟人表达情感不可或缺的部分，实现高质量的人脸表情迁移/重建/编辑能够极大地推动数字虚拟人的发展。  '
          '工作内容：  1. 学习调研人脸表情迁移/重建/编辑等方向的前沿研究，负责/参与某个模块的算法设计、代码实现、算法调优等；   2. '
          '鼓励投稿人工智能领域顶级会议论文；  3. 按个人意愿，可以独立承担课题，也可以参与团队共同完成课题；',
  '字段20': '1. 具有良好的深度学习基础，熟练使用python，至少熟练使用一门深度学习框架，如pytorch、tensorflow等； \n'
          '2. 至少有一项基于深度学习技术的项目经验，项目背景不限； \n'
          '3. 有责任心和上进心，自我驱动力强，求知欲强；      \n'
          '\n'
          '加分项：\u200b\u200b\n'
          '1. 在人脸相关算法、三维人脸重建等方向上有至少一个方向有项目经验；\n'
          '2. 有AI顶级会议或期刊发表经历。'},

 {'字段13_文本': '虚拟人口型/表情/肢体动画参数合成',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1156&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '虚拟人',
  '字段18': '2023届及以后',
  '字段19': '伏羲虚拟人团队在动画参数生成方向已有长期积累，包括论文发表（CVPR、AAAI、IJCAI）和落地应用，并载入《2020年虚拟数字人发展白皮书》，参与制定国家行业标准《虚拟数字人指标要求和评估方法》。  '
          '无论在3A游戏大作，还是3D动漫影视，亦或是虚拟IP短视频中，游戏人物/动漫人物/虚拟人物都会包含有大量的动画，目前主流的解决方法是对这些动画进行动作捕捉或者由专业的动画师去手K动作，很显然这两种方法都需要大量的时间和高昂的人力资源成本。语音生成动画技术仅输入一段语音，便可以自动地生成合理的人物动作动画。该技术可以极大地节省人力成本和时间成本。随着之后游戏产业、动漫产业以及短视频行业的蓬勃发展，语音驱动动作动画合成技术会得到更多更广泛的应用。 '
          '研究内容： '
          '1、研究探索讨论基于深度学习的动画参数合成技术，包括但不限于：动画参数合成相关文献调研、动画参数合成算法设计和代码实现、动画参数合成算法调优和项目落地 '
          '2、鼓励将研究成果发表顶级会议论文。',
  '字段20': '1.具有深度学习基础，熟练使用python，至少熟练使用一门深度学习框架，如pytorch、tensorflow等；\n'
          '2.有责任心和上进心，具有较强的自我驱动力。\n'
          '\n'
          '加分项：\n'
          '1.有AI顶级会议或期刊发表经历；\n'
          '2.有动画参数合成相关项目经历。'},

{'字段13_文本': '远程渲染引擎技术研究',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1170&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '雷火事业群',
  '字段17': '图形学引擎',
  '字段18': '2023届及以后',
  '字段19': '研究远程渲染引擎的可行性和实现，用于解决云渲染技术中的CPU、GPU负载均衡问题',
  '字段20': '1.计算机或相关专业，本科及以上学历；\n'
          '2.热爱游戏和游戏开发；\n'
          '3.精通C/C++编程语言及其思想；\n'
          '4.扎实的计算机基础知识，深入理解数据结构，算法，操作系统等知识；\n'
          '5.良好的逻辑综合分析能力，以及强烈的解决问题的意愿；\n'
          '6.强烈的求知欲，和与之相适应的学习能力；\n'
          '7.良好的沟通能力，能清晰、准确的在团队成员中传达自己的想法；\n'
          '8.有计算机图形学基础，熟悉一种或多种图形API，如DirectX 11/12，OpenGL，Vulkan或Metal。\n'
          '\n'
          '加分项：\n'
          '1.有渲染和图形学相关技术实践经验；\n'
          '2.熟悉或精通深度学习相关技术；\n'
          '3.熟悉一种或多种商业游戏引擎，如Unity3D，UnrealEngine等。'},

{'字段13_文本': '肢体动作识别与时序检测',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1155&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '虚拟人',
  '字段18': '2023届及以后',
  '字段19': '在自然人机交互、虚拟现实、智能视频监控和多媒体搜索等多个领域的应用中，都需要动作识别或动作检测作为其基础技术。本课题研究如何在视频序列中提取有效的上下文信息，从而识别视频中的动作片段并进行分类。  '
          '工作内容： 1. '
          '学习调研关于肢体动作识别和动作时序检测的前沿研究、围绕相关业务落地场景、负责/参与某个模块的算法设计、代码实现、算法调优等；  2. '
          '鼓励投稿人工智能领域顶级会议论文；  3. 按个人意愿，可以独立承担课题，也可以参与团队共同完成课题；',
  '字段20': '1. 具有扎实的深度学习基础，熟练使用python，至少熟练使用一门深度学习框架，如pytorch、tensorflow等； \n'
          '2. 至少有一项基于深度学习技术的项目经验，项目背景不限； \n'
          '3. 有责任心和上进心，自我驱动力强，求知欲强。      \n'
          '\n'
          '加分项：\u200b\n'
          '1. 在人体关键点检测、动作识别、视频理解、或时序检测等方向上有项目经验;\n'
          '2. 有AI顶级会议或期刊发表经历。'},

 {'字段13_文本': '大规模预训练模型的高效微调技术',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1141&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': 'NLP',
  '字段18': '2023届及以后',
  '字段19': '如今的自然语言处理相关的应用开发，已经转向了在预训练语言模型上，使用业务功能相关的少量标注语料进行微调的模式。这种普遍的实践有一个缺点，由于预训练语言模型普遍规模庞大，部署需要大量计算资源，对于很多产品功能来说性价比并不高。这严重影响了最新的自然语言处理研究成果在工业界的落地。我们希望能够基于现有的研究成果，继续研究能够降低nlp应用部署成本的高效微调技术。 '
          'a. 调研不同finetuning的方法并复现,在不同任务上比较它们的评测指标、资源利用情况等。 b. '
          '在现有的finetuning方法的基础上思考改进的方案或提出新的方案，并进行实验比较。 c. 撰写学术论文并投稿。',
  '字段20': '1. '
          '对深度学习和NLP的基础概念有深入的理解，例如Transformer的结构，常见的神经网络模块，常见的优化算法，基本的NLP任务和评测指标，以及常见的技巧如模型蒸馏、数据增强等等；\n'
          '2. 具有较强的软件工程技能，并能根据自己钻研的研究问题的需要，自如地应对工程挑战；\n'
          '3. 能够快速落实研究思路，对其进行迭代，并进行实证评估；\n'
          '4. 对NLP前沿研究保持敏锐关注，了解预训练、课程学习、对抗训练等技术热点。\n'
          '\n'
          '加分项：\n'
          '1. '
          '在人工智能及自然语言处理相关的顶级会议(如：ACL、EMNLP、NAACL、AAAI、IJCAI、ICASSP等）上发表过论文（一作或二作）；\n'
          '2. 有自然文本生成、模型压缩等相关的项目经验。'},

 {'字段13_文本': '玩家行为数据的无监督表示学习',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1145&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': 'NLP',
  '字段18': '2023届及以后',
  '字段19': '1. 价值意义： '
          '目前，在游戏中部署不同的机器学习服务（比如外挂检测，社交推荐等）通常需要完成数据处理、样本标注与模型开发等工作。样本标注依赖业务知识，昂贵且费时费力；模型开发通常也依赖于大量的特征工程，需要专家知识，从而提升了开发相应服务的门槛；另外，这些服务的模型也相互独立，很难进行迁移与复用；此外，海量的原始无标记数据中蕴含的丰富信息没有得到有效利用，限制了各个独立服务的效果。为了解决这些问题，我们将NLP领域中流行的大规模无监督预表示学习方法应用在游戏玩家行为数据上。我们以行为序列数据和文本数据的差异为出发点，结合游戏中序列的特性，从序列的预处理、模型结构、训练任务这三方面做改进，设计适合游戏玩家行为数据的无监督表示学习方案。 '
          '2.研究内容： a. 研究玩家行为数据的无监督表示学习算法 b. '
          '研究无监督表示学习应用于各类下游任务（反外挂、社交推荐、道具推荐等）的有效性 c. 基于无监督表示学习的可解释性研究 d. '
          '撰写学术论文并投稿',
  '字段20': '1. '
          '对深度学习和NLP的基础概念有深入的理解，例如Transformer的结构，常见的神经网络模块，常见的优化算法，基本的NLP任务和评测指标，以及常见的技巧如模型蒸馏、数据增强等等；\n'
          '2. 具有较强的软件工程技能，并能根据自己钻研的研究问题的需要，自如地应对工程挑战；\n'
          '3. 能够快速落实研究思路，对其进行迭代，并进行实证评估；\n'
          '4. 对NLP前沿研究保持敏锐关注，了解预训练、课程学习、对抗训练等技术热点。\n'
          '\n'
          '加分项：\n'
          '1. '
          '在人工智能及自然语言处理相关的顶级会议(如：ACL、EMNLP、NAACL、AAAI、IJCAI、ICASSP等）上发表过论文（一作或二作）；\n'
          '2. 有自然文本生成、模型压缩等相关的项目经验。'},

 {'字段13_文本': 'AI换脸',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1154&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '虚拟人',
  '字段18': '2023届及以后',
  '字段19': '多次登上微博热搜的AI换脸已经在影视制作、社交娱乐等领域大放异彩，相信你也看到过很多换脸视频。所谓换脸，就是将原图片或视频中的人脸替换为另一个人的人脸，并保证视觉上的自然。传统的基于图像处理的方法难免“违和感”严重，生成网络的出现与发展为“一键换脸”提供了新的工具。基于生成网络产生的换脸视频足以“以假乱真”；换脸技术具有非常广泛的应用。在影视方面，换脸技术可以将影视作品中有污点的艺人进行替换，而无需耗时费力的重新拍摄；这一技术也能够让那些长时间没有动态的演员重新回到观众的视线；在个性推荐方面，根据个人喜好，推送你喜欢的明星人脸模特，甚至在广告中可以看到你的家人朋友；在打击“假脸”方面，逼真的换脸能够为“鉴别假脸”算法提供更多高难度的数据。  '
          '研究内容： 1. 调研人脸生成的相关方法，改进换脸算法； 2. 鼓励将研究成果发表顶级会议论文。',
  '字段20': '1.对换脸、人脸生成方向感兴趣；\n'
          '2.具有深度学习基础，熟练使用python，至少熟练使用一门深度学习框架，如pytorch、tensorflow等；\n'
          '3.有责任心和上进心，具有较强的自我驱动力。\n'
          '\n'
          '加分项：\n'
          '1.有AI顶级会议或期刊发表经历；\n'
          '2.有人脸生成相关项目经历。'},

{'字段13_文本': '用于大规模预训练模型的条件计算技术',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1140&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': 'NLP',
  '字段18': '2023届及以后',
  '字段19': '1. '
          '价值意义：大规模预训练的语言模型的提出，对自然语言处理的应用方法论是一次巨大的颠覆。目前所有的自然语言处理相关应用，几乎都引入了大规模预训练语言模型。OpenAI发现增大语言模型的规模能够持续地提升语言模型的能力；Google的科学家发现语言模型能够有效地学习知识，并且增大模型规模能提升学习知识的能力，这些发现促使我们将语言模型的规模不断推向现有工程能力的极限。为了在有限的计算能力下持续地扩大模型的规模，conditional '
          'computation得到了研究者们的关注。谷歌的Switch Transformer利用Mixture of '
          'Experts技术率先达到了1.6万亿参数规模；快手的推荐精排模型也达到了1.9万亿参数。为了进一步拓宽自然语言处理的能力边界，使用conditional '
          'computation技术来提升预训练模型的大小将成为一个重要手段。 2.研究内容: a. Mixture of '
          'Layers等conditional computation算法的复现，并且将其应用于语言模型的训练。 b. '
          '对现有的conditional computation算法进行改进，使其能够在相同的算力约束下，更高效地使用参数，达到更好的效果。 '
          'c. 撰写学术论文并投稿。',
  '字段20': '1. '
          '对深度学习和NLP的基础概念有深入的理解，例如Transformer的结构，常见的神经网络模块，常见的优化算法，基本的NLP任务和评测指标，以及常见的技巧如模型蒸馏、数据增强等等；\n'
          '2. 具有较强的软件工程技能，并能根据自己钻研的研究问题的需要，自如地应对工程挑战；\n'
          '3. 能够快速落实研究思路，对其进行迭代，并进行实证评估；\n'
          '4. 对NLP前沿研究保持敏锐关注，了解预训练、课程学习、对抗训练等技术热点。\n'
          '\n'
          '加分项：\n'
          '1. '
          '在人工智能及自然语言处理相关的顶级会议(如：ACL、EMNLP、NAACL、AAAI、IJCAI、ICASSP等）上发表过论文（一作或二作）；\n'
          '2. 有自然文本生成、模型压缩等相关的项目经验。'},

 {'字段13_文本': '二次元人像检测、分割和生成',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1353&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '图像',
  '字段18': '2023届及以后',
  '字段19': '针对二次元人像照片的检测和语义分割，此外也针对真实人像输入生成二次元风格的照片输出。对于越来越火的二次元风格游戏，此项研究能有效帮助玩家上传自拍照或者二次元图片从而在游戏中自动生成类似的二次元风格角色',
  '字段20': '1. 熟练使用C++，Python；\n'
          '2. 熟练使用OpenGL，了解三维模型及渲染基础知识；\n'
          '3. 熟练使用PyTorch或TensorFlow深度学习库。\n'
          '\n'
          '加分项：\n'
          '1. 熟悉三维人脸重建、游戏渲染管线、可微渲染技术等，有相关项目经验或论文；\n'
          '2. 在计算机视觉相关顶会（Sigraph/ Sigraph '
          'Asian、NIPS、CVPR、ICCV、ECCV、AAAI等）发表过人脸相关论文。'},

 {'字段13_文本': 'Selfplay在复杂游戏场景中的研究与应用',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1115&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '强化学习',
  '字段18': '2023届及以后',
  '字段19': 'Selfplay作为目前训练强智能体的重要方法，囊括了包括对手池维护以及对手选择在内的多个部分，同时当前也有多种经验主义的训练方法（如 '
          'naive selfplay, δ-uniform selfplay,PBT '
          '），但是目前还没有一套明确的结论来支撑不同方案的选择。另外在selfplay过程中如何维护策略的 '
          'selfplay，PSRO等多样性和鲁棒性也是实际落地项目中经常要考量的问题。我们将研究selfplay过程中如何更好地去维护对手池和优化对手选择机制以及提升训练过程中模型策略的多样性和鲁棒性，并且会在多种实际复杂游戏中去进行算法落地与应用（如 '
          '逆水寒1v1等）。',
  '字段20': '1.了解深度强化学习，尤其是Selfplay算法、进化算法，博弈论以及多智能体强化学习等理论和算法；\n'
          '2.熟练使用Python，熟悉tensorflow、pytorch等至少一种深度学习库，并有实际动手实现强化学习算法的经验3.熟悉强化学习大规模并行训练框架。\n'
          '\n'
          '加分项：\n'
          '1.在人工智能和强化学习相关的顶级会议或期刊\n'
          '（如：ICML、NeurIPS、ICLR、IJCAI、AAAI、AAMAS、ICRA、IROS、UAI）上发表过论文（一作或二作）；\n'
          '2.强化学习相关竞赛上获得过优胜名次。'},

{'字段13_文本': '基于多模态学习的文本生成图像研究',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1104&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '图像',
  '字段18': '2023届及以后',
  '字段19': '生成符合给定文本描述的真实图像（text-to-image）是多模态任务之一，具有巨大的应用潜力，如图像编辑、视频游戏和计算机辅助设计。最近，由于生成对抗网络(GANs)在生成真实感图像方面的成功，文本到图像的生成取得了显著进展。文本到图像的生成创作需要对被创造的事物有深刻的理解:厨师、小说家和电影制作人必须比食客、读者或电影观众更深刻地理解食物、写作和电影。如果我们的计算机视觉系统要真正理解视觉世界，它们不仅必须能够识别图像，而且必须能够生成图像。除了传授深刻的视觉理解，生成逼真图像的方法也可以是实际有用的。在短期内，自动图像生成可以帮助艺术家或平面设计师的工作。有一天，我们可能会用生成定制图像和视频的算法来取代图像和视频搜索引擎，以响应每个用户的个人喜好。',
  '字段20': '1. 熟练使用C++，Python。\n'
          '2. 熟练使用Pytorch、tensorflow、caffe、mxnet等深度学习库的其中一个或多个。\n'
          '加分项：\n'
          '1. 有图像生成相关项目经验，熟悉最新GAN/VAE等图像生成方法。\n'
          '2. 发表过图形、计算机视觉和机器人领域顶会论文 （包括但不限于Sigraph/ Sigraph '
          'Asian、NIPS、CVPR、ICCV/ECCV、AAAI、ACMMM、ICRA、IROS、RSS和ISRR）。'},

 {'字段13_文本': '基于单张RGB图像的3D头发重建',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1106&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '图像',
  '字段18': '2023届及以后',
  '字段19': '根据单张或者多张头部图像进行头发三维重建在计算机图形学以及计算机视觉领域目前是一个比较热门的研究方向。目前大多数头发重建基于数据匹配的方法或者多视角重建的方法，不是保存过多的头发模型就是需要大的计算量，不能直接应用于游戏中。该项目的主要目标是，根据用户上传的头部图像，生成能够在游戏中使用的发丝或面片的头发模型。',
  '字段20': '1. 熟练使用C++，Python。\n'
          '2. 熟练使用OpenGL，了解三维模型及渲染基础知识。\n'
          '3. 熟练使用PyTorch或TensorFlow深度学习库。\n'
          '加分项：\n'
          '1. 熟悉三维重建、游戏渲染管线、可微渲染技术等，有相关项目经验或论文。\n'
          '2. 在计算机视觉相关顶会（Sigraph/ Sigraph '
          'Asian、NIPS、CVPR、ICCV、ECCV、AAAI等）发表过相关论文。'},

{'字段13_文本': '多智能体强化学习方法在复杂游戏场景中的创新研究',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1116&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '强化学习',
  '字段18': '2023届及以后',
  '字段19': '我们会基于一些内部或外部的游戏平台（如：GoogleFootball、逆水寒3v3、潮人篮球等），考查现有最新方法（如：QMIX、WQMIX、Qatten、QPLEX、MAVEN）在实际游戏场景中的效果以及存在的问题，同时对比centralized '
          'learning方法和decentralized '
          'learning方法在复杂场景中的效果，找到它们各自合适的应用场景。其次，我们将针对现有算法的不足，提出能够更好地协作配合、学习效率更高，并能在复杂游戏环境具有良好扩展性（scalability）的多智能体强化学习算法。我们还将研究对手建模、多智能体协同探索、多智能体异步决策等前沿问题，并探究这些技术对实习游戏落地的意义。',
  '字段20': '1.了解深度强化学习，尤其是多智能体强化学习相关知识，掌握值函数分解、多智能体通信、多智能体协作等理论和算法；\n'
          '2.熟练使用Python，熟悉tensorflow、pytorch等至少\n'
          '一种深度学习库，并有实际动手实现强化学习算法的经验；\n'
          '3.熟悉强化学习大规模并行训练框架。\n'
          '\n'
          '加分项：\n'
          '1.在人工智能和强化学习相关的顶级会议或期刊\n'
          '（如：ICML、NeurIPS、ICLR、IJCAI、AAAI、AAMAS、ICRA、IROS、UAI）上发表过论文（一作或二作）；\n'
          '2.强化学习相关竞赛上获得过优胜名次。'},

{'字段13_文本': '基于单目RGB视频的三维人体重建',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1103&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '图像',
  '字段18': '2023届及以后',
  '字段19': '人体姿态估计(Human Pose Estimation,\n'
          'HPE)在计算机视觉文献中得到了广泛的研究，它涉及到从传感器获取的输入数据（特别是图像和视频）中估计人体部位的配置。HPE提供人体的几何和运动信息，被广泛应用于人机交互、运动分析、增强现实(AR)、虚拟现实(VR)、医疗保健等领域。该项目基于输入的视频，估计其中的人体姿态并重建出人体三维mesh模型。',
  '字段20': '1. 熟练使用C++，Python。\n'
          '2. 熟练使用Pytorch、tensorflow、caffe、mxnet等深度学习库的其中一个或多个。\n'
          '加分项：\n'
          '1. 有图像处理或三维重建等相关项目经验。\n'
          '2. 发表过图形、计算机视觉和机器人领域顶会论文 （包括但不限于Sigraph/ Sigraph '
          'Asian、NIPS、CVPR、ICCV/ECCV、AAAI、ACMMM、ICRA、IROS、RSS和ISRR）。'},

 {'字段13_文本': '智能游戏测试',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1117&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '强化学习',
  '字段18': '2023届及以后',
  '字段19': '将人工智能技术（强化学习，搜索技术，图像识别等）应用在游戏测试领域， '
          '探索智能游戏测试新方案，提升游戏测试的效率。目前在探索中的方案包括游戏剧情任务自动化回归， 战斗场景测试， '
          '手游兼容性测试等。游戏测试的过程包括 “玩” 和 “查”两个过程， 强化学习和搜索技术已经可以赋予游戏角色一定的智能玩游戏， '
          '而异常检测技术能够自动完成 bug识别功能， 将AI的能力融合到一起可以创新性地实现更加高效的游戏测试方案。',
  '字段20': '1.了解计算机视觉，深度强化学习等相关算法， 具备扎实的深度学习基础；\n'
          '2.熟练使用Python，熟悉tensorflow、pytorch等至少一种深度学习库，并有实际动手实现强化学习算法的经验，能够独立实现算法开发；\n'
          '3.如果有基于图像的异常识别和UI识别等相关项目经验者优先。\n'
          '\n'
          '加分项：\n'
          '在人工智能和强化学习相关的顶级会议或期刊（如：ICML、NeurIPS、ICLR、IJCAI、AAAI、AAMAS、ICRA、IROS、UAI）上发表过论文（一作或二作）。'},

{'字段13_文本': '基于先验知识引导的强化学习算法在复杂游戏场景中的研究与应用',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1114&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '强化学习',
  '字段18': '2023届及以后',
  '字段19': '基于先验知识引导的强化学习算法在复杂游戏场景中的研究与应用。目前的强化学习算法已经可以在很多游戏中击败人类玩家，但是在商业游戏的应用中还会遇到某些特定情况下行为怪异，行为模式与人类区别较大，面对复杂问题时的训练难度较大等问题。我们针对这些问题，以实际游戏场景为依托（如：Google '
          'Football、逆水寒流派挑战、倩女幽魂关宁校场等），利用玩家数据，考察现有的模仿学习（Behavior Clone， '
          'Gail等）、数据相关的强化学习算法（Learning from Demonstration，Human in '
          'Loop等）以及课程学习等方法的效果。并进一步针对我们游戏场景中的实际问题，验证现有方法在解决这些问题时的适配程度，研究改进方法，探究这些技术对实习游戏落地的意义。',
  '字段20': '1.对深度学习理论有了解，熟悉常见深度强化学习算法的理论体系。\n'
          '2.了解常见的模仿学习算法，掌握BehaviorClone，GAIL，Learning from '
          'Demonstration，课程学习等相关理论和算法。\n'
          '3.熟练使用Python，熟悉tensorflow、pytorch等至少一种深度学习库，并有实际动手实现强化学习算法的经验\n'
          '4.熟悉强化学习大规模并行训练框架。\n'
          '\n'
          '加分项：\n'
          '1.在人工智能和强化学习相关的顶级会议或期刊\n'
          '（如：ICML、NeurIPS、ICLR、IJCAI、AAAI、AAMAS、ICRA、IROS、UAI）上发表过论文（一作或二作）\n'
          '2.强化学习相关竞赛上获得过优胜名次。\n'
          '3.有模仿学习相关算法应用经验。'},

 {'字段13_文本': '探索强化学习中模型预训练方案与应用',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1113&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '强化学习',
  '字段18': '2023届及以后',
  '字段19': '目前强化学习在很多任务上已经取得了很好的表现，但是在复杂问题中强化学习的训练成本非常高。如何有效利用现有模型学习到的知识来加速新任务的学习速度或复用现有的模型仍然是较困难的问题。我们将基于公开环境以及内部的游戏平台（如逆水寒、倩女幽魂等），探索在1v1战斗场景下模型迁移的新方案，并在实际游戏中进行算法落地应用。',
  '字段20': '1.了解深度强化学习，熟悉常见深度强化学习算法的理论体系； \n'
          '2.熟练使用Python，熟悉tensorflow、pytorch等至少 一种深度学习库，并有实际动手实现强化学习算法的经验； \n'
          '3.如有强化学习迁移相关经验者优先。  \n'
          '\n'
          '加分项： \n'
          '在人工智能和强化学习相关的顶级会议或期刊 '
          '（如：ICML、NeurIPS、ICLR、IJCAI、AAAI、AAMAS、ICRA、IROS、UAI）上发表过论文（一作或二作）。'},

 {'字段13_文本': '基于游戏战场中行为序列的动作价值评估',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1111&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '用户画像',
  '字段18': '2023届及以后',
  '字段19': '动作价值评估一直是团队分析的核心研究课题之一，它对于关键动作识别、成员贡献评估、策略分析、团队招募等问题的决策都有非常重要的价值。 '
          '目前的研究大多数集中于根据专家经验筛选的关键动作评估，如足球中的射门，篮球中的扣篮、盖帽、投篮；一些其它相关研究以球的传输轨迹作为切入点，研究各个成员在球的传输网络中发挥的作用；此外最新的研究开始考虑比赛情境和动作对后续比赛的长期影响来评估动作价值，但建模方式仍限制于几个特定球类运动，难以拓展到更为广义的团队协作任务中，如游戏战场。',
  '字段20': '1.有一定游戏经历（有网易游戏体验经历者优先），热爱人工智能； \n'
          '2.熟悉常用的机器学习、深度学习、数据挖掘相关算法； \n'
          '3.熟悉掌握并使用Python语言，了解至少一种其它编程语言，包括但不限于C/C++、Java、R、Lua等； \n'
          '4.熟练使用主流深度学习框架，如tensorflow、pytorch、keras等，有端上深度学习经验者优先； \n'
          '5.对游戏与AI技术结合的场景，如游戏反外挂系统、游戏匹配系统、游戏战报系统、玩家流失原因分析等有热情、有想法； \n'
          '6.具有良好的沟通、协作和语言表达能力，较高的开发效率，责任意识强； \n'
          '7.专注、精益求精、时间规划能力强、有主动学习及深入思考的能力； \n'
          '8.具有良好的数学基础、英语信息检索能力和阅读能力； \n'
          '9.编程基础扎实，逻辑思维能力强，有较强的学习能力和创新思维。  \n'
          '\n'
          '加分项： \n'
          '1.有KDD、WWW、ICML、NIPS、ICLR、AAAI、IJCAI、ICDM、WSDM、CIKM等论文发表者优先； \n'
          '2.有AutoML、计算机视觉等人工智能领域经验者优先； \n'
          '3.有运筹优化/组合优化、强化学习等人工智能领域经验者优先； \n'
          '4.有因果推断、可解释性AI等人工智能领域经验者优先； \n'
          '5.可保证实习六个月及以上，能够长期实习的同学优先。'},

{'字段13_文本': '基于游戏战场中行为序列的玩家竞技风格挖掘',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1112&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '用户画像',
  '字段18': '2023届及以后',
  '字段19': '玩家在游戏战场中的竞技风格各有不同，即使在操作同一种英雄时，他们的表现也各有不同。在用户建模时，我们通常会创建一些用户模板（如下图），然后对线上的用户进行检测和归类，然后在游戏中对不同的用户群体分别构建合适的游戏机制。但是这样的用户模板很难充分对玩家群体进行划分，在不同的游戏战场中，玩家的竞技风格划分往往多种多样，仅仅依赖游戏设计者的游戏感知和专家经验无法对全体玩家进行准确的刻画。因此，玩家竞技风格的自动发现，对于用户画像和后续的游戏设计来说意义重大。',
  '字段20': '1.有一定游戏经历（有网易游戏体验经历者优先），热爱人工智能； \n'
          '2.熟悉常用的机器学习、深度学习、数据挖掘相关算法； \n'
          '3.熟悉掌握并使用Python语言，了解至少一种其它编程语言，包括但不限于C/C++、Java、R、Lua等； \n'
          '4.熟练使用主流深度学习框架，如tensorflow、pytorch、keras等，有端上深度学习经验者优先； \n'
          '5.对游戏与AI技术结合的场景，如游戏反外挂系统、游戏匹配系统、游戏战报系统、玩家流失原因分析等有热情、有想法； \n'
          '6.具有良好的沟通、协作和语言表达能力，较高的开发效率，责任意识强； \n'
          '7.专注、精益求精、时间规划能力强、有主动学习及深入思考的能力； \n'
          '8.具有良好的数学基础、英语信息检索能力和阅读能力； \n'
          '9.编程基础扎实，逻辑思维能力强，有较强的学习能力和创新思维。  \n'
          '\n'
          '加分项： \n'
          '1.有KDD、WWW、ICML、NIPS、ICLR、AAAI、IJCAI、ICDM、WSDM、CIKM等论文发表者优先； \n'
          '2.有AutoML、计算机视觉等人工智能领域经验者优先； \n'
          '3.有运筹优化/组合优化、强化学习等人工智能领域经验者优先； \n'
          '4.有因果推断、可解释性AI等人工智能领域经验者优先； \n'
          '5.可保证实习六个月及以上，能够长期实习的同学优先。'},

 {'字段13_文本': '基于玩家角色轨迹的游戏外挂检测',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1109&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '用户画像',
  '字段18': '2023届及以后',
  '字段19': '游戏工作室通过脚本自动化的完成任务，大量的获取游戏内产出的货币并低价转售给其他玩家来获取利益，但这一行为严重的损害了游戏的经济系统，并一定程度的会影响其他正常玩家的游戏体验。鼠标轨迹和角色移动轨迹是游戏中易于收集的数据，且正常玩家（如图1）和脚本（如图2）在这些数据上的表现会有一定的差异，是一个可行的用于辨别外挂的监测点。',
  '字段20': '1.有一定游戏经历（有网易游戏体验经历者优先），热爱人工智能； \n'
          '2.熟悉常用的机器学习、深度学习、数据挖掘相关算法； \n'
          '3.熟悉掌握并使用Python语言，了解至少一种其它编程语言，包括但不限于C/C++、Java、R、Lua等； \n'
          '4.熟练使用主流深度学习框架，如tensorflow、pytorch、keras等，有端上深度学习经验者优先； \n'
          '5.对游戏与AI技术结合的场景，如游戏反外挂系统、游戏匹配系统、游戏战报系统、玩家流失原因分析等有热情、有想法； \n'
          '6.具有良好的沟通、协作和语言表达能力，较高的开发效率，责任意识强； \n'
          '7.专注、精益求精、时间规划能力强、有主动学习及深入思考的能力； \n'
          '8.具有良好的数学基础、英语信息检索能力和阅读能力； \n'
          '9.编程基础扎实，逻辑思维能力强，有较强的学习能力和创新思维。  \n'
          '\n'
          '加分项： \n'
          '1.有KDD、WWW、ICML、NIPS、ICLR、AAAI、IJCAI、ICDM、WSDM、CIKM等论文发表者优先； \n'
          '2.有AutoML、计算机视觉等人工智能领域经验者优先； \n'
          '3.有运筹优化/组合优化、强化学习等人工智能领域经验者优先；\n'
          '4.有因果推断、可解释性AI等人工智能领域经验者优先； \n'
          '5.可保证实习六个月及以上，能够长期实习的同学优先。'},

{'字段13_文本': '基于游戏客户端截图的FPS透视挂检测',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1110&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '用户画像',
  '字段18': '2023届及以后',
  '字段19': '透视外挂常见于第一人称视角射击（ First Person Shoot，简称 FPS） '
          '游戏。透视外挂通过在玩家看到的游戏界面上添加若干非游戏内的、外挂产生的元素的方式，在对局中为作弊玩家带来巨大的信息优势，从而使作弊玩家更有可能获胜或获得其他利益。',
  '字段20': '1.有一定游戏经历（有网易游戏体验经历者优先），热爱人工智能； \n'
          '2.熟悉常用的机器学习、深度学习、数据挖掘相关算法； \n'
          '3.熟悉掌握并使用Python语言，了解至少一种其它编程语言，包括但不限于C/C++、Java、R、Lua等； \n'
          '4.熟练使用主流深度学习框架，如tensorflow、pytorch、keras等，有端上深度学习经验者优先； \n'
          '5.对游戏与AI技术结合的场景，如游戏反外挂系统、游戏匹配系统、游戏战报系统、玩家流失原因分析等有热情、有想法； \n'
          '6.具有良好的沟通、协作和语言表达能力，较高的开发效率，责任意识强； \n'
          '7.专注、精益求精、时间规划能力强、有主动学习及深入思考的能力； \n'
          '8.具有良好的数学基础、英语信息检索能力和阅读能力； \n'
          '9.编程基础扎实，逻辑思维能力强，有较强的学习能力和创新思维。  \n'
          '\n'
          '加分项： \n'
          '1.有KDD、WWW、ICML、NIPS、ICLR、AAAI、IJCAI、ICDM、WSDM、CIKM等论文发表者优先； \n'
          '2.有AutoML、计算机视觉等人工智能领域经验者优先； \n'
          '3.有运筹优化/组合优化、强化学习等人工智能领域经验者优先； \n'
          '4.有因果推断、可解释性AI等人工智能领域经验者优先； \n'
          '5.可保证实习六个月及以上，能够长期实习的同学优先。'},

{'字段13_文本': '基于因果推断的反事实时序预测',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1352&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '用户画像',
  '字段18': '2023届及以后',
  '字段19': '目前，已经有很多成熟的方法和工具可以进行时序预测，虽然进一步降低预测的精度是一件有意义的事情，但对于很多场景而言，只知道未来的预测值产生的价值比较有限，更重要的是知道哪些因素对未来的预测会产生影响，甚至知道如果将某些因素进行改变会对未来产生多大的效益。 '
          '比如，在我们的游戏场景中，给游戏策划一些重要指标的预测值对他们而言产生的价值有限，他们更看重的是一些干预策略的调整带来的变化，也就是更看重因果推断。',
  '字段20': '1.有一定游戏经历（有网易游戏体验经历者优先），热爱人工智能；\n'
          '2.熟悉常用的机器学习、深度学习、数据挖掘相关算法；\n'
          '3.熟悉掌握并使用Python语言，了解至少一种其它编程语言，包括但不限于C/C++、Java、R、Lua等；\n'
          '4.熟练使用主流深度学习框架，如tensorflow、pytorch、keras等，有端上深度学习经验者优先；\n'
          '5.对游戏与AI技术结合的场景，如游戏反外挂系统、游戏匹配系统、游戏战报系统、玩家流失原因分析等有热情、有想法；\n'
          '6.具有良好的沟通、协作和语言表达能力，较高的开发效率，责任意识强；\n'
          '7.专注、精益求精、时间规划能力强、有主动学习及深入思考的能力；\n'
          '8.具有良好的数学基础、英语信息检索能力和阅读能力；\n'
          '9.编程基础扎实，逻辑思维能力强，有较强的学习能力和创新思维。\n'
          '\n'
          '加分项：\n'
          '1.有KDD、WWW、ICML、NIPS、ICLR、AAAI、IJCAI、ICDM、WSDM、CIKM等论文发表者优先；\n'
          '2.有AutoML、计算机视觉等人工智能领域经验者优先；\n'
          '3.有运筹优化/组合优化、强化学习等人工智能领域经验者优先；\n'
          '4.有因果推断、可解释性AI等人工智能领域经验者优先；\n'
          '5.可保证实习六个月及以上，能够长期实习的同学优先。'},

 {'字段13_文本': '人体动作捕捉系统自动解算',
  '字段13_链接': 'https://campus.163.com/app/detail/index?id=1677&projectId=36',
  '字段14': '实习',
  '字段15': '杭州',
  '字段16': '网易伏羲',
  '字段17': '图像',
  '字段18': '2023届及以后',
  '字段19': '数字虚拟人肢体驱动依赖于角色三维模型的关节控制器。本课题研究如何将现有数字虚拟人的肢体动画参数重定向到肢体比例不完全对应的其他三维模型上，增加虚拟数字人算法的普适性与扩展性。  '
          '工作内容： 1. 学习调研关于人体动作重定向的前沿研究、围绕相关业务落地场景、负责/参与某个模块的算法设计、代码实现、算法调优等；  '
          '2. 鼓励投稿人工智能领域顶级会议论文；  3. 按个人意愿，可以独立承担课题，也可以参与团队共同完成课题；',
  '字段20': '1. 具有良好的深度学习基础，熟练使用python，至少熟练使用一门深度学习框架，如pytorch、tensorflow等；\n'
          '2. 至少有一项基于深度学习技术的项目经验，项目背景不限；\n'
          '3. 有责任心和上进心，自我驱动力强，求知欲强；     \n'
          '\n'
          '加分项：\n'
          '1. 从事过人体关键点检测、动作识别、三维人体重建、人体运动学等方向；\n'
          '2. 有AI顶级会议或期刊发表经历。'},
]

